export const text = `基本信息
白客，本名罗宏明，1988年7月9日出生于山东省泰安市，毕业于南京传媒学院，中国内地影视男演员、配音演员、编剧、导演 [1] [60] [102] [116] [134]。
2012年，参演的微电影《老魔术师》上映，这是他首次接触演员工作 [2]。2013年，在叫兽易小星执导的搞笑网剧《万万没想到》中饰演男主“王大锤”，从而走进观众视野；随后，参演万合天宜出品的轻喜剧《报告老板》播出 [3] [104]。2014年，主演的喜剧《万万没想到：小兵过年》在湖南卫视播出，剧中饰演王大锤；同年，客串韩寒执导的公路电影《后会无期》 [4]。2016年，凭借奇幻喜剧电影《万万没想到》获得“首届亚洲新媒体电影节最佳男演员奖” [97-98]，2017年，凭借在贺岁档大片《大闹天竺》中的表现，首次获得中澳国际电影节的提名，并最终荣获“最佳新人奖” [101]。2018年，主演由顾长卫导演执导的爱情喜剧《遇见你真好》，剧中饰演张文生 [8]。2019年，在爱情电影《被光抓走的人》中饰演筷子 [10]。2021年，在爱情片《合法伴侣》中饰演金天，参演的电影《门锁》中，饰演郑飞 [39-40] [66]。2023年，与苗苗、张颂文共同领衔主演的励志影片《不止不休》播出，剧中饰演实习记者韩东 [119] [135]，同年，在年代剧《问苍茫》中饰演蒋介石 [95]；12月，与董成鹏、庄达菲共同领衔主演的喜剧电影《年会不能停！》上映，剧中饰演马杰 [91]。 2024年，凭借电影《年会不能停！》获得第37届中国电影金鸡奖最佳男配角提名。 [152]12月，获得2024爱奇艺尖叫之夜年度男配角 [156]。2025年，领衔主演的电影《唐探1900》上映； [159]3月，与辛芷蕾共同主演的电视剧《仁心俱乐部》播出 [133] [164]。
艺    名白客
本    名罗宏明 [102]
外文名White. K [139]
Bai ke
Hongming Luo
性    别男
民    族汉族
国    籍中国
出生地山东省泰安市 [102]
出生日期1988年7月9日 [102]
毕业院校南京传媒学院 [60] [102]
星    座巨蟹座 [139]
血    型O型 [139]
身    高178 cm [139]
体    重75 kg [139]
经纪公司北京万合天宜影视文化有限公司 [136]（2014年）
代表作品万万没想到、江照黎明、报告老板、被光抓走的人、大闹天竺、不止不休、年会不能停！
职    业演员 [139]
主要成就2020腾讯娱乐年度盛典年度电影潜力演员 [38]
早年经历
播报
编辑
1988年7月9日出生于山东省泰安市，因喜欢郑渊洁的童话《白客》而把艺名取为白客 [116]。
2010年，在中国传媒大学南广学院（现南京传媒学院）学习播音与主持艺术专业的白客即将大学毕业，和同寝室成员组成“cucn201”本地配音组，为《搞笑漫画日和》制作中文版的配音，作品发出的一周时间点击率便超过了一百多万 [1] [11] [60] [103]。
2012年春节后，白客辞去扬州某台的主持工作，选择“北漂”，与叫兽小星、小爱、子墨等“初创成员”一同在北京大望路的一间小屋里成立网络短剧团队 [117]。
演艺经历
播报
编辑
初露锋芒
2012年8月，由席中中执导的爱情题材微电影《老魔术师》在七夕情人节前夕上映，白客首次接触演员工作，在影片中饰演年轻时候的“魔术师” [2] [12]；同年，与小爱共同担任编剧，并主演的喜剧电影《那些年狂追我的女孩》上映，白客在其中饰演主人公“小白” [12]。
2013年，参演叫兽易小星执导的Mini剧《万万没想到》在湖南卫视与优酷、土豆热播，剧中饰演呆呆木木的屌丝王大锤 [13]；随后，参演《万万没想到》原班人马参与制作的网络迷你剧《报告老板》播出 [14]。
2014年春节期间，主演的贺岁搞笑剧《万万没想到：小兵过年》在湖南卫视播出，剧中饰演王大锤，该片第一集上线仅48小时播放量突破500万；随后，与撒贝宁、王冠一同担任2014年央视网络春晚主持；1月4日，百事贺岁微电影《把乐带回家2014》首映，片中饰演了大反派副店长阿豪，颠覆了以往呆萌无害的衰男形象 [15] [106]；5月，客串爱奇艺网络剧《高科技少女喵》，饰演少年汪 [16] [105]；同年，《万万没想到第二季》在优酷播出，白客继续出演王大锤一角 [17]；7月，客串出演韩寒执导的公路电影《后会无期》，出演的是与以往表演风格完全不同的一个角色，剧中形象上邋遢而不修边幅，短短几句台词便让观众直呼惊艳 [18] [107-108]；同年11月，主演的系列网络剧《报告老板！贺岁篇》播出，作为电影中的原班人马“重操旧业”，再度饰演小蘑菇一角 [19]。
2015年2月25日，由万合天宜、优酷联合出品的首部古装推理单元喜剧《名侦探狄仁杰》播出，在该剧中白客扮演狄仁杰的助手兼好友白元芳 [20]；同年12月18日，奇幻喜剧电影《万万没想到》上映，片中饰演的王大锤是自诩为妖王的小妖，该片累计票房2.78亿（截止12月21日） [5] [109]。`
